Natural_Reef_CFD/highRelief/Scenario_15/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          66;
        startFace       313107;
    }
    outlet
    {
        type            patch;
        nFaces          63;
        startFace       313173;
    }
    atmosphere
    {
        type            patch;
        nFaces          228;
        startFace       313236;
    }
    bathymetry
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1745;
        startFace       313464;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          313244;
        startFace       315209;
    }
)

// ************************************************************************* //
